vmux0.0.11/ycsbVMs_ycsb_16vms_vmux-dpdk-e810_-1rps_rep1/vm3.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-02-10 02:12:47:051 0 sec: 0 operations; est completion in 0 second 
2025-02-10 02:12:56:900 10 sec: 78847 operations; 7884.7 current ops/sec; est completion in 15 hours 7 minutes [READ: Count=39568, Max=46591, Min=78, Avg=122.19, 90=148, 99=265, 99.9=2943, 99.99=3861] [UPDATE: Count=39310, Max=8471, Min=77, Avg=120.3, 90=152, 99=262, 99.9=2803, 99.99=4011] 
2025-02-10 02:13:06:900 20 sec: 170623 operations; 9177.6 current ops/sec; est completion in 13 hours 58 minutes [READ: Count=45670, Max=4491, Min=76, Avg=107.58, 90=140, 99=199, 99.9=325, 99.99=1120] [UPDATE: Count=46075, Max=4065, Min=74, Avg=106.32, 90=140, 99=202, 99.9=337, 99.99=2065] 
2025-02-10 02:13:16:899 30 sec: 269425 operations; 9880.2 current ops/sec; est completion in 13 hours 16 minutes [READ: Count=49281, Max=5531, Min=77, Avg=100.44, 90=112, 99=159, 99.9=253, 99.99=540] [UPDATE: Count=49521, Max=2141, Min=76, Avg=99.13, 90=111, 99=154, 99.9=296, 99.99=2003] 
2025-02-10 02:13:26:899 40 sec: 367854 operations; 9842.9 current ops/sec; est completion in 12 hours 57 minutes [READ: Count=49101, Max=5315, Min=77, Avg=101.19, 90=113, 99=158, 99.9=253, 99.99=2073] [UPDATE: Count=49328, Max=731, Min=77, Avg=99.08, 90=111, 99=157, 99.9=256, 99.99=517] 
2025-02-10 02:13:36:899 50 sec: 461300 operations; 9344.6 current ops/sec; est completion in 12 hours 55 minutes [READ: Count=46628, Max=3801, Min=77, Avg=106.34, 90=133, 99=235, 99.9=375, 99.99=2187] [UPDATE: Count=46818, Max=3663, Min=75, Avg=104.58, 90=130, 99=234, 99.9=354, 99.99=1507] 
2025-02-10 02:13:46:899 60 sec: 559653 operations; 9835.3 current ops/sec; est completion in 12 hours 46 minutes [READ: Count=49366, Max=6487, Min=77, Avg=101.07, 90=112, 99=152, 99.9=258, 99.99=499] [UPDATE: Count=48987, Max=3981, Min=74, Avg=99.28, 90=111, 99=150, 99.9=246, 99.99=955] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-02-10 02:13:47:907 61 sec: 569647 operations; 9924.53 current ops/sec; est completion in 12 hours 45 minutes [READ: Count=4968, Max=538, Min=81, Avg=99.03, 90=110, 99=153, 99.9=195, 99.99=538] [CLEANUP: Count=1, Max=984, Min=984, Avg=984, 90=984, 99=984, 99.9=984, 99.99=984] [UPDATE: Count=5026, Max=6979, Min=79, Avg=99.22, 90=108, 99=152, 99.9=196, 99.99=2085] 
[OVERALL], RunTime(ms), 61011
[OVERALL], Throughput(ops/sec), 9336.791726082181
[TOTAL_GCS_Copy], Count, 53
[TOTAL_GC_TIME_Copy], Time(ms), 24
[TOTAL_GC_TIME_%_Copy], Time(%), 0.039337168707282294
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 53
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 0.039337168707282294
[READ], Operations, 284582
[READ], AverageLatency(us), 105.79058759865346
[READ], MinLatency(us), 76
[READ], MaxLatency(us), 46591
[READ], 95thPercentileLatency(us), 146
[READ], 99thPercentileLatency(us), 206
[READ], Return=OK, 284582
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 984.0
[CLEANUP], MinLatency(us), 984
[CLEANUP], MaxLatency(us), 984
[CLEANUP], 95thPercentileLatency(us), 984
[CLEANUP], 99thPercentileLatency(us), 984
[UPDATE], Operations, 285065
[UPDATE], AverageLatency(us), 104.12502411730658
[UPDATE], MinLatency(us), 74
[UPDATE], MaxLatency(us), 8471
[UPDATE], 95thPercentileLatency(us), 145
[UPDATE], 99thPercentileLatency(us), 209
[UPDATE], Return=OK, 285065
AUTOTEST_DONE